### This jupyter notebook contains contents of the lesson "Arithmetic operators in Series and Dataframe"

**Author : Umidjon Sattorov. Machine Learning engineer**

In [1]:
import pandas as pd
import numpy as np

In [2]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [3]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [4]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [5]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

Task : Create two series, one of which should contain integers and other one should contain boolean variables. Multiply first series to second one and return the result.

Task : Create two series, one of which should contain the names of people and the other one should contain surnames of them. Add them together.

____

In [7]:
df1 = pd.DataFrame(
    np.arange(9.).reshape(3, 3),
    columns = list('bcd'),
    index = ['Apple', 'Pomegranate', 'Grapes'] 
)

df2 = pd.DataFrame(
    np.arange(12.).reshape(4, 3),
    columns = list('abc'),
    index = ['Apple', 'Pomegranate', 'Melon', 'Fig']
)
df1

               b    c    d
Apple        0.0  1.0  2.0
Pomegranate  3.0  4.0  5.0
Grapes       6.0  7.0  8.0

In [8]:
df2

               a     b     c
Apple        0.0   1.0   2.0
Pomegranate  3.0   4.0   5.0
Melon        6.0   7.0   8.0
Fig          9.0  10.0  11.0

In [9]:
df1+df2

              a    b    c   d
Apple       NaN  1.0  3.0 NaN
Fig         NaN  NaN  NaN NaN
Grapes      NaN  NaN  NaN NaN
Melon       NaN  NaN  NaN NaN
Pomegranate NaN  7.0  9.0 NaN

In [10]:
df1-df2

              a    b    c   d
Apple       NaN -1.0 -1.0 NaN
Fig         NaN  NaN  NaN NaN
Grapes      NaN  NaN  NaN NaN
Melon       NaN  NaN  NaN NaN
Pomegranate NaN -1.0 -1.0 NaN

In [11]:
# add() function
df1.add(df2)

              a    b    c   d
Apple       NaN  1.0  3.0 NaN
Fig         NaN  NaN  NaN NaN
Grapes      NaN  NaN  NaN NaN
Melon       NaN  NaN  NaN NaN
Pomegranate NaN  7.0  9.0 NaN

In [12]:
# add() function with fill_value
df1.add(df2, fill_value = 0)

               a     b     c    d
Apple        0.0   1.0   3.0  2.0
Fig          9.0  10.0  11.0  NaN
Grapes       NaN   6.0   7.0  8.0
Melon        6.0   7.0   8.0  NaN
Pomegranate  3.0   7.0   9.0  5.0

Other Arithmetic Operations
add, radd – Addition (+)

* sub, rsub – Subtraction (-)

* div, rdiv – Division (/)

* floordiv, rfloordiv – Floor division (//)

* mul, rmul – Multiplication (*)

* pow, rpow – Exponentiation (**)

All of the operations above support the fill_value parameter.

____